//	XLCTextEx_1.0x	:	Test

//	DataRegEx01.cpp
//
#include "stdafx.h"

//======================================================================
//	DataRegEx01a
//======================================================================
//----------------------------------------------------------------------
//	DataRegEx01_00	空文字列の処理
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_00[]	=
{
	TQU("空文字列の処理"),
	TQU(""),
	TQU(""),
	TQU(""),
	TQU(""),

	TQU("空文字列の処理"),
	TQU(""),
	TQU("<$&>"),
	TQU(""),
	TQU("g"),

	TQU("空文字列の処理"),
	TQU(""),
	TQU("<$&>"),
	TQU("AbC123D"),
	TQU("g"),

	TQU("空文字列の処理"),
	TQU("\\d"),
	TQU(""),
	TQU("aB12C0-d"),
	TQU("g"),
};
int	nDataRegEx01_00	= sizeof(DataRegEx01_00) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_01	オプション
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_01[]	=
{
	//------------------------------------------------------------
	//	m、s オプション	(1)	\r\n の場合
	//------------------------------------------------------------
	TQU("m、s オプション\t(1)\t\\r\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\r\nd\r\n\r\nfgh"),
	TQU("g"),

	TQU("m、s オプション\t(1)\t\\r\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\r\nd\r\n\r\nfgh"),
	TQU("gm"),

	TQU("m、s オプション\t(1)\t\\r\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\r\nd\r\n\r\nfgh"),
	TQU("gs"),

	TQU("m、s オプション\t(1)\t\\r\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\r\nd\r\n\r\nfgh"),
	TQU("gms"),

	//------------------------------------------------------------
	//	m、s オプション	(2)	\n の場合
	//------------------------------------------------------------
	TQU("m、s オプション\t(2)\t\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\nd\n\nfgh"),
	TQU("g"),

	TQU("m、s オプション\t(2)\t\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\nd\n\nfgh"),
	TQU("gm"),

	TQU("m、s オプション\t(2)\t\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\nd\n\nfgh"),
	TQU("gs"),

	TQU("m、s オプション\t(2)\t\\n の場合"),
	TQU("^.+$"),
	TQU("<$&>"),
	TQU("abc\nd\n\nfgh"),
	TQU("gms"),

	//------------------------------------------------------------
	//	x オプション
	//------------------------------------------------------------
	TQU("x オプション"),
	TQU("a  # hello\n bc"),
	TQU("<$&>"),
	TQU("abcAbCabcaBc"),
	TQU("g"),

	TQU("x オプション"),
	TQU("a  # hello\n bc"),
	TQU("<$&>"),
	TQU("abcAbCabcaBc"),
	TQU("gx"),

	TQU("x オプション"),
	TQU("a  # hello\r\n bc"),
	TQU("<$&>"),
	TQU("abcAbCabcaBc"),
	TQU("gxi"),

	TQU("x オプション"),
	TQU("abc"),
	TQU("<$&>"),
	TQU("abcAbCabcaBc"),
	TQU("gxi"),

	//------------------------------------------------------------
	//	i オプション
	//------------------------------------------------------------
	TQU("i オプション"),
	TQU("ab"),
	TQU("<$&>"),
	TQU("ABbAbaBAＡＢａＡｂａＢｂａｂ"),
	TQU("g"),

	TQU("i オプション"),
	TQU("ab"),
	TQU("<$&>"),
	TQU("ABbAbaBAＡＢａＡｂａＢｂａｂ"),
	TQU("gi"),

	TQU("i オプション"),
	TQU("ab"),
	TQU("<$&>"),
	TQU("ABbAbaBAＡＢａＡｂａＢｂａｂ"),
	TQU("giw"),

	//------------------------------------------------------------
	//	d オプション	(1)
	//------------------------------------------------------------
	TQU("d オプション\t(1)"),
	TQU("AUEO"),
	TQU("<$&>"),
	TQU("AUEOaueo\xC4\xDC\xCB\xD6\xE4\xFC\xEB\xF6"),
	TQU("g"),

	TQU("d オプション\t(1)"),
	TQU("AUEO"),
	TQU("<$&>"),
	TQU("AUEOaueo\xC4\xDC\xCB\xD6\xE4\xFC\xEB\xF6"),
	TQU("gd"),

	TQU("d オプション\t(1)"),
	TQU("AUEO"),
	TQU("<$&>"),
	TQU("AUEOaueo\xC4\xDC\xCB\xD6\xE4\xFC\xEB\xF6"),
	TQU("gdi"),

	//------------------------------------------------------------
	//	d オプション	(2)
	//------------------------------------------------------------
	TQU("d オプション\t(2)"),
	TQU("さじ"),
	TQU("<$&>"),
	TQU("さしさじざしざじサシサジザシザジ"),
	TQU("g"),

	TQU("d オプション\t(2)"),
	TQU("さじ"),
	TQU("<$&>"),
	TQU("さしさじざしざじサシサジザシザジ"),
	TQU("gd"),

	TQU("d オプション\t(2)"),
	TQU("さじ"),
	TQU("<$&>"),
	TQU("さしさじざしざじサシサジザシザジ"),
	TQU("gdk"),

	//------------------------------------------------------------
	//	k オプション
	//------------------------------------------------------------
	TQU("k オプション"),
	TQU("かキ"),
	TQU("<$&>"),
	TQU("かきかキカきカキ"),
	TQU("g"),

	TQU("k オプション"),
	TQU("かキ"),
	TQU("<$&>"),
	TQU("かきかキカきカキ"),
	TQU("gk"),

	//------------------------------------------------------------
	//	l オプション
	//------------------------------------------------------------
	TQU("l オプション"),
	TQU("ヤュ"),
	TQU("<$&>"),
	TQU("やゆゃゅャユヤュ"),
	TQU("g"),

	TQU("l オプション"),
	TQU("ヤュ"),
	TQU("<$&>"),
	TQU("やゆゃゅャユヤュ"),
	TQU("gl"),

	TQU("l オプション"),
	TQU("ヤュ"),
	TQU("<$&>"),
	TQU("やゆゃゅャユヤュ"),
	TQU("gkl"),

	//------------------------------------------------------------
	//	w オプション
	//------------------------------------------------------------
	TQU("w オプション"),
	TQU("a1%"),
	TQU("<$&>"),
	TQU("a1%ａ１％ａ1%a１％A1%Ａ１％Ａ1%A１％"),
	TQU("ｇ"),

	TQU("w オプション"),
	TQU("a1%"),
	TQU("<$&>"),
	TQU("a1%ａ１％ａ1%a１％A1%Ａ１％Ａ1%A１％"),
	TQU("gw"),

	TQU("w オプション"),
	TQU("a1%"),
	TQU("<$&>"),
	TQU("a1%ａ１％ａ1%a１％A1%Ａ１％Ａ1%A１％"),
	TQU("gwi"),

	//------------------------------------------------------------
	//	オプションの変更
	//------------------------------------------------------------
	TQU("オプションの変更"),
	TQU("abc"),
	TQU("<$&>"),
	TQU("abCABcaBcabc"),
	TQU("g"),

	TQU("オプションの変更"),
	TQU("(?i:ab)c"),
	TQU("<$&>"),
	TQU("abCABcaBcabc"),
	TQU("g"),

	TQU("オプションの変更"),
	TQU("(?-i:ab)C"),
	TQU("<$&>"),
	TQU("abcABcaBc"),
	TQU("gi"),

	TQU("オプションの変更"),
	TQU("ab(?i)c"),
	TQU("<$&>"),
	TQU("abCABcaBcabc"),
	TQU("g"),

	TQU("オプションの変更"),
	TQU("さし"),
	TQU("<$&>"),
	TQU("さしサしさシサシさじサじさジサジ"),
	TQU("g"),

	TQU("オプションの変更"),
	TQU("さ(?k:し)"),
	TQU("<$&>"),
	TQU("さしサしさシサシさじサじさジサジ"),
	TQU("g"),

	TQU("オプションの変更"),
	TQU("さ(?kd:し)"),
	TQU("<$&>"),
	TQU("さしサしさシサシさじサじさジサジ"),
	TQU("g"),
};
int	nDataRegEx01_01	= sizeof(DataRegEx01_01) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_02	エスケープシーケンス
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_02[]	=
{
	//------------------------------------------------------------
	//	エスケープシーケンス	(1)
	//------------------------------------------------------------
	TQU("エスケープシーケンス\t(1)"),
	TQU("\\101\\61\\x43"),
	TQU("<$&>"),
	TQU("0A1ca1Cd"),
	TQU("g"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\101\\61\\x43"),
	TQU("<$&>"),
	TQU("0A1ca1Cd"),
	TQU("gi"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\u0041\\u42"),
	TQU("<$&>"),
	TQU("abAbabAB"),
	TQU("g"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\u0041\\u42"),
	TQU("<$&>"),
	TQU("abAbabAB"),
	TQU("gi"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\u{41 042}"),
	TQU("<$&>"),
	TQU("abAbabAB"),
	TQU("g"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\u{41 042}"),
	TQU("<$&>"),
	TQU("abAbabAB"),
	TQU("gi"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("a\\u{42}c"),
	TQU("<$&>"),
	TQU("abcdABCD"),
	TQU("g"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("a\\u{42}c"),
	TQU("<$&>"),
	TQU("abcdABCD"),
	TQU("gi"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("a\\u{0042 0043}d"),
	TQU("<$&>"),
	TQU("abcdABCD"),
	TQU("g"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("a\\u{0042 0043}d"),
	TQU("<$&>"),
	TQU("abcdABCD"),
	TQU("gi"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\u2000b"),
	TQU("<$&>"),
	TQU("\\xD840\\xDC0B\\xD840\\xDC89\\xD840\\xDCA2"),
	TQU("gi"),

	TQU("エスケープシーケンス\t(1)"),
	TQU("\\u20089"),
	TQU("<$&>"),
	TQU("\\xD840\\xDC0B\\xD840\\xDC89\\xD840\\xDCA2"),
	TQU("gi"),

	//------------------------------------------------------------
	//	エスケープシーケンス	(2)
	//------------------------------------------------------------
	TQU("エスケープシーケンス\t(2)"),
	TQU("[\\cI\\cJ\\cM]"),
	TQU("<$&>"),
	TQU("a\tb\r\nc"),
	TQU("g"),

	TQU("エスケープシーケンス\t(2)"),
	TQU("[\\t\\r\\n]"),
	TQU("<$&>"),
	TQU("a\tb\r\nc"),
	TQU("g"),
};
int	nDataRegEx01_02	= sizeof(DataRegEx01_02) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_03	文字クラス
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_03[]	=
{
	//------------------------------------------------------------
	//	文字クラス	(1-1)	\w, \d, \s, \W, \D, \S
	//------------------------------------------------------------
	TQU("文字クラス\t(1-1)\t\\w"),
	TQU("\\w"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-1)\t\\d"),
	TQU("\\d"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-1)\t\\s"),
	TQU("\\s"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-1)\t\\W"),
	TQU("\\W"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-1)\t\\D"),
	TQU("\\D"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-1)\t\\S"),
	TQU("\\S"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	//------------------------------------------------------------
	//	文字クラス	(1-2)	[ ] 内の \w, \d, \s, \W, \D, \S
	//------------------------------------------------------------
	TQU("文字クラス\t(1-2)\t\\"),
	TQU("[\\w]+"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-2)\t\\"),
	TQU("[\\d]+"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-2)\t\\"),
	TQU("[\\s]+"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-2)\t\\"),
	TQU("[\\W]+"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-2)\t\\"),
	TQU("[\\D]+"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(1-2)\t\\"),
	TQU("[\\S]+"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	//------------------------------------------------------------
	//	文字クラス	(2-1)	\p{}, \P{}
	//------------------------------------------------------------
	TQU("文字クラス\t(2-1)\t\\"),
	TQU("\\p{Lu}"),
	TQU("<$&>"),
	TQU("ABCabcＡＢＣａｂｃあいう絵御"),
	TQU("g"),

	TQU("文字クラス\t(2-1)\t\\"),
	TQU("\\P{Lu}"),
	TQU("<$&>"),
	TQU("ABCabcＡＢＣａｂｃあいう絵御"),
	TQU("g"),

	TQU("文字クラス\t(2-1)\t\\"),
	TQU("\\p{^Lu}"),
	TQU("<$&>"),
	TQU("ABCabcＡＢＣａｂｃあいう絵御"),
	TQU("g"),

	//------------------------------------------------------------
	//	文字クラス	(2-2)	[] 内の \p{}, \P{}
	//------------------------------------------------------------
	TQU("文字クラス\t(2-2)\t\\"),
	TQU("[\\p{Lu}]+"),
	TQU("<$&>"),
	TQU("ABCabcＡＢＣａｂｃあいう絵御"),
	TQU("g"),

	TQU("文字クラス\t(2-2)\t\\"),
	TQU("[\\P{Lu}]+"),
	TQU("<$&>"),
	TQU("ABCabcＡＢＣａｂｃあいう絵御"),
	TQU("g"),

	TQU("文字クラス\t(2-2)\t\\"),
	TQU("[\\p{^Lu}]+"),
	TQU("<$&>"),
	TQU("ABCabcＡＢＣａｂｃあいう絵御"),
	TQU("g"),

	//------------------------------------------------------------
	//	文字クラス	(2-3)	\p{}, \P{} 各種の条件
	//------------------------------------------------------------
	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{Ll}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{LL}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{ll}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{gc=Ll}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{GC=LL}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{General_Category=Lowercase_Letter}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{general_category=lowercase_letter}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{Lo}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{L}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{nd}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{NL}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{pc}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{P}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{Alphabetic}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{alphabetic=true}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{ALPHA=FALSE}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{Uppercase}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{lowercase}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{script=hiragana}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),

	TQU("文字クラス\t(2-3)\t\\"),
	TQU("\\p{BLOCK=KATAKANA}"),
	TQU("<$&>"),
	TQU("ab12$_& ａｂ１２＄＿＆　あいウエ\t亜伊一弐\xC6\xD840\xDC0B"),
	TQU("g"),
};
int	nDataRegEx01_03	= sizeof(DataRegEx01_03) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_04	位置による照合
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_04[]	=
{
	//------------------------------------------------------------
	//	文字列の先頭と終端
	//------------------------------------------------------------
	TQU("文字列の先頭 ^"),
	TQU("^"),
	TQU("○"),
	TQU("abc"),
	TQU("g"),

	TQU("文字列の先頭 ^"),
	TQU("^"),
	TQU("○"),
	TQU("abc\r\n\r\ndef"),
	TQU("g"),

	TQU("文字列の先頭 ^"),
	TQU("^"),
	TQU("○"),
	TQU("abc\r\n\r\ndef"),
	TQU("gm"),

	TQU("文字列の先頭 ^"),
	TQU("^"),
	TQU("○"),
	TQU("abc\r\n\r\ndef"),
	TQU("gs"),

	TQU("文字列の先頭 ^"),
	TQU("^"),
	TQU("○"),
	TQU("abc\r\n\r\ndef"),
	TQU("gms"),

	TQU("文字列の先頭 ^ （\\n のみ）"),
	TQU("^"),
	TQU("○"),
	TQU("abc\n\ndef"),
	TQU("g"),

	TQU("文字列の先頭 ^ （\\n のみ）"),
	TQU("^"),
	TQU("○"),
	TQU("abc\n\ndef"),
	TQU("gm"),

	TQU("文字列の先頭 ^ （\\n のみ）"),
	TQU("^"),
	TQU("○"),
	TQU("abc\n\ndef"),
	TQU("gs"),

	TQU("文字列の先頭 ^ （\\n のみ）"),
	TQU("^"),
	TQU("○"),
	TQU("abc\n\ndef"),
	TQU("gms"),

	TQU("文字列の終端 $"),
	TQU("$"),
	TQU("×"),
	TQU("abc"),
	TQU("g"),

	TQU("文字列の終端 $"),
	TQU("$"),
	TQU("×"),
	TQU("abc\r\n\r\ndef"),
	TQU("g"),

	TQU("文字列の終端 $"),
	TQU("$"),
	TQU("×"),
	TQU("abc\r\n\r\ndef"),
	TQU("gm"),

	TQU("文字列の終端 $"),
	TQU("$"),
	TQU("×"),
	TQU("abc\r\n\r\ndef"),
	TQU("gs"),

	TQU("文字列の終端 $"),
	TQU("$"),
	TQU("×"),
	TQU("abc\r\n\r\ndef"),
	TQU("gms"),

	TQU("文字列の終端 $（\\n のみ）"),
	TQU("$"),
	TQU("×"),
	TQU("abc\n\ndef"),
	TQU("g"),

	TQU("文字列の終端 $（\\n のみ）"),
	TQU("$"),
	TQU("×"),
	TQU("abc\n\ndef"),
	TQU("gm"),

	TQU("文字列の終端 $（\\n のみ）"),
	TQU("$"),
	TQU("×"),
	TQU("abc\n\ndef"),
	TQU("gs"),

	TQU("文字列の終端 $（\\n のみ）"),
	TQU("$"),
	TQU("×"),
	TQU("abc\n\ndef"),
	TQU("gms"),

	TQU("文字列の先頭 \\A"),
	TQU("\\A.+$"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("g"),

	TQU("文字列の先頭 \\A"),
	TQU("\\A.+$"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("gm"),

	TQU("文字列の先頭 \\A"),
	TQU("\\A.+$"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("gs"),

	TQU("文字列の終端 \\z"),
	TQU("^.+\\z"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("g"),

	TQU("文字列の終端 \\z"),
	TQU("^.+\\z"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("gm"),

	TQU("文字列の終端 \\z"),
	TQU("^.+\\z"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("gs"),

	TQU("文字列の終端 \\z"),
	TQU("^.+\\z"),
	TQU("<$&>"),
	TQU("abc\r\ndef\r\n"),
	TQU("gm"),

	TQU("文字列の終端 \\z"),
	TQU("^.+\\z"),
	TQU("<$&>"),
	TQU("abc\ndef\n"),
	TQU("gm"),


	TQU("文字列の終端 \\Z"),
	TQU("^.+\\Z"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("g"),

	TQU("文字列の終端 \\Z"),
	TQU("^.+\\Z"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("gm"),

	TQU("文字列の終端 \\Z"),
	TQU("^.+\\Z"),
	TQU("<$&>"),
	TQU("abc\ndef"),
	TQU("gs"),

	TQU("文字列の終端 \\Z"),
	TQU("^.+\\Z"),
	TQU("<$&>"),
	TQU("abc\r\ndef\r\n"),
	TQU("gm"),

	TQU("文字列の終端 \\Z"),
	TQU("^.+\\Z"),
	TQU("<$&>"),
	TQU("abc\ndef\n"),
	TQU("gm"),

	TQU("文字列の先頭と終端"),
	TQU("\\A.*\\z"),
	TQU("<$&>"),
	TQU("abc"),
	TQU(""),

	TQU("文字列の先頭と終端"),
	TQU("\\A.*\\z"),
	TQU("<$&>"),
	TQU("abc\r\n"),
	TQU(""),

	TQU("文字列の先頭と終端"),
	TQU("\\A.*\\z"),
	TQU("<$&>"),
	TQU("abc\n"),
	TQU(""),

	TQU("文字列の先頭と終端"),
	TQU("\\A.*\\Z"),
	TQU("<$&>"),
	TQU("abc"),
	TQU(""),

	TQU("文字列の先頭と終端"),
	TQU("\\A.*\\Z"),
	TQU("<$&>"),
	TQU("abc\r\n"),
	TQU(""),

	TQU("文字列の先頭と終端"),
	TQU("\\A.*\\Z"),
	TQU("<$&>"),
	TQU("abc\n"),
	TQU(""),

	//------------------------------------------------------------
	//	空行
	//------------------------------------------------------------
	TQU("空行"),
	TQU("^\r\n"),
	TQU("<$&>"),
	TQU("abc\r\n\r\ndef"),
	TQU("gm"),

	TQU("空行"),
	TQU("^\r\n"),
	TQU(""),
	TQU("abc\r\n\r\ndef"),
	TQU("gm"),

	TQU("空行"),
	TQU("^\n"),
	TQU("<$&>"),
	TQU("abc\n\ndef"),
	TQU("gm"),

	TQU("空行"),
	TQU(""),
	TQU("<$&>"),
	TQU("abc\n\ndef"),
	TQU("gm"),

	TQU("空行"),
	TQU("^$"),
	TQU("<$&>"),
	TQU("abc\r\n\r\ndef"),
	TQU("gm"),

	TQU("空行"),
	TQU("^$"),
	TQU("<$&>"),
	TQU("abc\n\ndef"),
	TQU("gm"),

	TQU("空行の削除"),
	TQU("^$"),
	TQU(""),
	TQU("abc\r\n\r\ndef"),
	TQU("gm"),

	TQU("空行の削除"),
	TQU("^$"),
	TQU(""),
	TQU("abc\n\ndef"),
	TQU("gm"),

	//------------------------------------------------------------
	//	\G
	//------------------------------------------------------------
	TQU("\\G"),
	TQU("\\Gabc"),
	TQU("<$&>"),
	TQU("AbcABCdabc"),
	TQU("gi"),

	//------------------------------------------------------------
	//	境界
	//------------------------------------------------------------
	TQU("境界"),
	TQU("\\ba"),
	TQU("<$&>"),
	TQU("aba acad$ae"),
	TQU("gi"),

	TQU("境界"),
	TQU("\\Ba"),
	TQU("<$&>"),
	TQU("aba acad$ae"),
	TQU("gi"),
};
int	nDataRegEx01_04	= sizeof(DataRegEx01_04) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_05	後方参照
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_05[]	=
{
	TQU("後方参照"),
	TQU("(ab)\\1"),
	TQU("<$&>"),
	TQU("ABABababAbaB"),
	TQU("g"),

	TQU("後方参照"),
	TQU("(ab)\\1"),
	TQU("<$&>"),
	TQU("ABABababAbaB"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(a)(b)\\2\\1"),
	TQU("<$&>"),
	TQU("ABAaBabBabAbBa"),
	TQU("g"),

	TQU("後方参照"),
	TQU("(a)(b)\\2\\1"),
	TQU("<$&>"),
	TQU("ABAaBabBabAbBa"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(a)(b)\\g2\\g1"),
	TQU("<$&>"),
	TQU("ABAaBabBabAbBa"),
	TQU("g"),

	TQU("後方参照"),
	TQU("(a)(b)\\g2\\g1"),
	TQU("<$&>"),
	TQU("ABAaBabBabAbBa"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(\\w\\d)\\1"),
	TQU("<$&>"),
	TQU("ab1A2A23c4C45"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(ab|cd)\\1"),
	TQU("<$&>"),
	TQU("aBCDcdaabABaBCdc"),
	TQU("g"),

	TQU("後方参照"),
	TQU("(ab|cd)\\1"),
	TQU("<$&>"),
	TQU("aBCDcdaabABaBCdc"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(?<マッチ>ab|cd)\\k<マッチ>"),
	TQU("<$&>"),
	TQU("aBCDcdaabABaBCdc"),
	TQU("g"),

	TQU("後方参照"),
	TQU("(?<マッチ>ab|cd)\\k<マッチ>"),
	TQU("<$&>"),
	TQU("aBCDcdaabABaBCdc"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(?'マッチ'ab|cd)\\k'マッチ'"),
	TQU("<$&>"),
	TQU("aBCDcdaabABaBCdc"),
	TQU("gi"),

	TQU("後方参照"),
	TQU("(?<char>\\p{alpha})(?'num'\\p{nd})\\k<char>\\k'num'"),
	TQU("<$&>"),
	TQU("a1A2a2b3B3c4c4"),
	TQU("g"),

	TQU("後方参照"),
	TQU("(?'char'\\p{alpha})(?<num>\\p{nd})\\k<char>\\k'num'"),
	TQU("<$&>"),
	TQU("a1A2a2b3B3c4c4"),
	TQU("gi"),
};
int	nDataRegEx01_05	= sizeof(DataRegEx01_05) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_06	前方一致、前方不一致、後方一致、後方不一致
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_06[]	=
{
	TQU("前方一致"),
	TQU("\\w+(?=\\.)"),
	TQU("<$&>"),
	TQU("He is. The dog ran. The sun is out."),
	TQU("g"),

	TQU("前方不一致"),
	TQU("\\b(?!un)\\w+\\b"),
	TQU("<$&>"),
	TQU("unsure sure unity used"),
	TQU("g"),

	TQU("後方一致"),
	TQU("(?<=19)\\d{2}\\b"),
	TQU("<$&>"),
	TQU("1851 1999 1950 1905 2003"),
	TQU("gq"),

	TQU("後方不一致"),
	TQU("(?<!19)\\d{2}\\b"),
	TQU("<$&>"),
	TQU("1851 1999 1950 1905 2003"),
	TQU("gq"),
};
int	nDataRegEx01_06	= sizeof(DataRegEx01_06) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_07	量指定子
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_07[]	=
{
	TQU("量指定子"),
	TQU("a*"),
	TQU("<$&>"),
	TQU("baaac"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a*?"),
	TQU("<$&>"),
	TQU("baaac"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a+"),
	TQU("<$&>"),
	TQU("baaac"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a+?"),
	TQU("<$&>"),
	TQU("baaac"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a?"),
	TQU("<$&>"),
	TQU("baaac"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a??"),
	TQU("<$&>"),
	TQU("baaac"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a{2,3}"),
	TQU("<$&>"),
	TQU("baaaaa"),
	TQU("g"),

	TQU("量指定子"),
	TQU("a{2,3}?"),
	TQU("<$&>"),
	TQU("baaaaa"),
	TQU("g"),
};
int	nDataRegEx01_07	= sizeof(DataRegEx01_07) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_08	選択
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_08[]	=
{
	TQU("選択"),
	TQU("(ab|cd)"),
	TQU("<$&>"),
	TQU("aBCDcdABaAB"),
	TQU("gi"),

	TQU("選択（条件分岐）"),
	TQU("(?:(a)|b)(?(1)1|2)"),
	TQU("<$&>"),
	TQU("a2d2a1b1b2c3c1"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?:(?<pre>a)|b)(?(<pre>)1|2)"),
	TQU("<$&>"),
	TQU("a2d2a1b1b2c3c1"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?(?=\\D)a|1)"),
	TQU("<$&>"),
	TQU("a2d2a1b1b2c3c1"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?(?!\\d)a|1)"),
	TQU("<$&>"),
	TQU("a2d2a1b1b2c3c1"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?(?<=a)1|2)"),
	TQU("<$&>"),
	TQU("a2d2a1b1b2c3c1"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?(?<!a)1|2)"),
	TQU("<$&>"),
	TQU("a2d2a1b1b2c3c1"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?(\\p{Lu})A\\p{LL})"),
	TQU("<$&>"),
	TQU("AbCDeFGhiJkLMnO"),
	TQU("g"),

	TQU("選択（条件分岐）"),
	TQU("(?(\\d)3| )"),
	TQU("<$&>"),
	TQU("Ab23 31"),
	TQU("g"),
};
int	nDataRegEx01_08	= sizeof(DataRegEx01_08) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_09	ブラケット表現
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_09[]	=
{
	//------------------------------------------------------------
	//	ブラケット表現
	//------------------------------------------------------------
	TQU("ブラケット表現"),
	TQU("[aＢア]"),
	TQU("<$&>"),
	TQU("aBAbａＢＡｂあアｱ"),
	TQU("g"),

	TQU("ブラケット表現"),
	TQU("[aＢア]"),
	TQU("<$&>"),
	TQU("aBAbａＢＡｂあアｱ"),
	TQU("gw"),

	TQU("ブラケット表現"),
	TQU("[aＢア]"),
	TQU("<$&>"),
	TQU("aBAbａＢＡｂあアｱ"),
	TQU("gwk"),

	TQU("ブラケット表現"),
	TQU("[aＢア]"),
	TQU("<$&>"),
	TQU("aBAbａＢＡｂあアｱ"),
	TQU("gwki"),

	TQU("ブラケット表現"),
	TQU("[や]"),
	TQU("<$&>"),
	TQU("ヤやャゃ"),
	TQU("g"),

	TQU("ブラケット表現"),
	TQU("[や]"),
	TQU("<$&>"),
	TQU("ヤやャゃ"),
	TQU("gl"),

	TQU("ブラケット表現"),
	TQU("[や]"),
	TQU("<$&>"),
	TQU("ヤやャゃ"),
	TQU("gkl"),

	TQU("ブラケット表現"),
	TQU(".[.]+"),
	TQU("<$&>"),
	TQU("ab.c.."),
	TQU("g"),

	//------------------------------------------------------------
	//	ブラケット表現	範囲
	//------------------------------------------------------------
	TQU("ブラケット表現\t範囲"),
	TQU("[a-c]+"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghij"),
	TQU("g"),

	TQU("ブラケット表現\t範囲"),
	TQU("[a-c]+"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghij"),
	TQU("gi"),

	TQU("ブラケット表現\t範囲"),
	TQU("[^a-c]+"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghij"),
	TQU("gi"),

	TQU("ブラケット表現\t範囲"),
	TQU("[C-Gd-h]+"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghij"),
	TQU("g"),

	TQU("ブラケット表現\t範囲"),
	TQU("[C-Gd-h]+"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghij"),
	TQU("gi"),

	TQU("ブラケット表現\t範囲"),
	TQU("[^C-Gd-h]+"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghij"),
	TQU("gi"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う-お]"),
	TQU("<$&>"),
	TQU("あいうえおかき"),
	TQU("gk"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う－お]"),
	TQU("<$&>"),
	TQU("あいうえおかき"),
	TQU("gkw"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う-お]"),
	TQU("<$&>"),
	TQU("アイウエオカキ"),
	TQU("gk"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う－お]"),
	TQU("<$&>"),
	TQU("アイウエオカキ"),
	TQU("gk"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う－お]"),
	TQU("<$&>"),
	TQU("アイウエオカキ"),
	TQU("gkw"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う-おエ-カ]"),
	TQU("<$&>"),
	TQU("あいうえおかきｱｲｳｴｵｶｷアイウエオカキ"),
	TQU("g"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う-おエ-カ]"),
	TQU("<$&>"),
	TQU("あいうえおかきｱｲｳｴｵｶｷアイウエオカキ"),
	TQU("gk"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う-おエ-カ]"),
	TQU("<$&>"),
	TQU("あいうえおかきｱｲｳｴｵｶｷアイウエオカキ"),
	TQU("gkw"),

	TQU("ブラケット表現\t範囲"),
	TQU("[う-おエ-カ]"),
	TQU("<$&>"),
	TQU("あいうえおかきｱｲｳｴｵｶｷアイウエオカキぁぃぅぇぉヵヶ"),
	TQU("gkwl"),

	TQU("ブラケット表現\t範囲"),
	TQU("[Ｂ-Ｄ]"),
	TQU("<$&>"),
	TQU("ＡＢＣＤＥａｂｃｄｅ"),
	TQU("gi"),

	TQU("ブラケット表現\t範囲"),
	TQU("[Ｂ-Ｄ]"),
	TQU("<$&>"),
	TQU("ＡＢＣＤＥａｂｃｄｅ"),
	TQU("ｇ"),

	TQU("ブラケット表現\t範囲"),
	TQU("[d-b]"),
	TQU("<$&>"),
	TQU("abcdef"),
	TQU("g"),

	//------------------------------------------------------------
	//	ブラケット表現	POSIX 文字クラス
	//------------------------------------------------------------
	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:alnum:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:ALNUM:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:alpha:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:ascii:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:blank:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:cntrl:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:digit:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:graph:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:lower:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:print:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:punct:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:space:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:upper:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:word:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:xdigit:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:^digit:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:^space:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[[:^word:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[^[:alnum:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	TQU("ブラケット表現\tPOSIX 文字クラス"),
	TQU("[^[:alpha:][:digit:]]"),
	TQU("<$&>"),
	TQU("!\"#$&\\ 12ABcd_！”＃＄＆￥　１２ＡＢｃｄ＿\tあいウエ御可\xD840\xDC0B\xD840\xDCA4"),
	TQU("g"),

	//------------------------------------------------------------
	//	ブラケット表現	集合演算
	//------------------------------------------------------------
	TQU("ブラケット表現\t集合演算"),
	TQU("[a-f||c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-f||c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-f||c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[B-Ea-f||E-Hc-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:alnum:]||$]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("gw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[%||[:alnum:]||$]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("gw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:alnum:]||[:punct:]]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:upper:]||\\p{lowercase}]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-i--c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-i--c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-i--c-j]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-eg-j--b-cf-j]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-j--b-c--f-j]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:alnum:]--[:digit:]]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:alnum:]--[b-d]]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:alnum:]--[b-d]]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("gi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:alnum:]--[b-d]]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("giw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[\\w--\\p{nd}]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[$%12ab--\\w]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[\\w--1-2--b-d]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("gwi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-f~~c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("g"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-f~~c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("gi"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[a-f~~c-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("giw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[b-i~~d-g]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("giw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[d-g~~b-i]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("giw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[c-eh-j~~b-df-i]"),
	TQU("<$&>"),
	TQU("ABCDEFGHIJabcdefghijＡＢＣＤＥＦＧＨＩＪａｂｃｄｅｆｇｈｉｊ"),
	TQU("giw"),

	TQU("ブラケット表現\t集合演算"),
	TQU("[[:ascii:]~~[:word:]]"),
	TQU("<$&>"),
	TQU("#$%&ABCDEFGHabcdefgh_＃＄％＆ＡＢＣＤＥＦＧＨａｂｃｄｅｆｇｈ0123０１２３＿"),
	TQU("g"),

	//------------------------------------------------------------
	//	ブラケット表現	照合要素
	//------------------------------------------------------------
	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ガ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("g"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ガ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gk"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ガ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gw"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ガ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gkw"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.カ゛.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("g"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.カ゛.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gk"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.カ゛.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gw"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.カ゛.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gkw"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ｶﾞ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("g"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ｶﾞ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gk"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ｶﾞ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gw"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ｶﾞ.]]"),
	TQU("<$&>"),
	TQU("がガｶﾞか゛カ゛"),
	TQU("gkw"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ab.]]"),
	TQU("<$&>"),
	TQU("ABAbaBab"),
	TQU("g"),

	TQU("ブラケット表現\t照合要素"),
	TQU("[[.ab.]]"),
	TQU("<$&>"),
	TQU("ABAbaBab"),
	TQU("gi"),
};
int	nDataRegEx01_09	= sizeof(DataRegEx01_09) / sizeof(TDataRegEx01);

//----------------------------------------------------------------------
//	DataRegEx01_10	置換文字列
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_10[]	=
{
	TQU("置換文字列"),
	TQU("[か－こ]+"),
	TQU("<$_>"),
	TQU("エオカクコシセ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("[か－こ]+"),
	TQU("<$&>"),
	TQU("エオカクコシセ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("[か－こ]+"),
	TQU("<$`>"),
	TQU("エオカクコシセ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("[か－こ]+"),
	TQU("<$'>"),
	TQU("エオカクコシセ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("([か－こ]+)([^か－こ]+)([か－こ]+)"),
	TQU("<$1>"),
	TQU("カキクセソケコ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("([か－こ]+)([^か－こ]+)([か－こ]+)"),
	TQU("<$2>"),
	TQU("カキクセソケコ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("([か－こ]+)([^か－こ]+)([か－こ]+)"),
	TQU("<$3>"),
	TQU("カキクセソケコ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("([か－こ]+)([^か－こ]+)([か－こ]+)"),
	TQU("$'$2$`"),
	TQU("カキクセソケコ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("([か－こ]+)([^か－こ]+)([か－こ]+)"),
	TQU("$3$2$1"),
	TQU("カキクセソケコ"),
	TQU("wk"),

	TQU("置換文字列"),
	TQU("(?<ka>[か－こ]+)(?'sa'[さ-そ]+)(?<ta>[た－と]+)"),
	TQU("<${ta}><${sa}><${ka}>"),
	TQU("アエカキクセソタチテナヌノ"),
	TQU("wk"),
};
int	nDataRegEx01_10	= sizeof(DataRegEx01_10) / sizeof(TDataRegEx01);


//----------------------------------------------------------------------
//	DataRegEx01_11	エラー対策
//----------------------------------------------------------------------
TDataRegEx01	DataRegEx01_11[]	=
{
	//------------------------------------------------------------
	//	無限ループ
	//------------------------------------------------------------
	TQU("無限ループ"),
	TQU("a*"),
	TQU("<$&>"),
	TQU(""),
	TQU("g"),

	TQU("無限ループ"),
	TQU("^*"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("^*?"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("$*"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("$*?"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("(?=a)*"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("(?=a)*?"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("(?<=a)*"),
	TQU("<$&>"),
	TQU("a"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("a*"),
	TQU("<$&>"),
	TQU("abac"),
	TQU("g"),

	TQU("無限ループ"),
	TQU("a*?"),
	TQU("<$&>"),
	TQU("abac"),
	TQU("g"),
};
int	nDataRegEx01_11	= sizeof(DataRegEx01_11) / sizeof(TDataRegEx01);
