//	XLCTextEx_1.0x	:	PLibTextEx

//	PLibTextEx.cpp
//
#include "stdafx.h"

NS_PLIB_TEXTEX_BEGIN

//======================================================================
//	PLibTextEx ÇÃèâä˙âªÇ∆èIóπèàóù
//======================================================================
//----------------------------------------------------------------------
//	Init
//----------------------------------------------------------------------
BOOL Init()
{
	//if (!PLib::RegEx::Init())	return FALSE;
	PLib::TextEx::InitTrPreset();
	return TRUE;
}

//----------------------------------------------------------------------
//	Cleanup
//----------------------------------------------------------------------
void Cleanup()
{
	PLib::TextEx::CleanupTrPreset();
	//PLib::RegEx::Cleanup();
}

NS_PLIB_TEXTEX_END
